// ունենալ `state` հետևյան կառուցվածքով 
// const [users, setUsers] = useState([
//   {
//     id:1,
//     firstName: "Jhon",
//     lastName: "Smith",
//     registredDate: moment(),
//     language: "javascript"
//   },
//   {...},
//   {...},
//   {...},
//   {...},
// ]) 
// Պետք է նկարել նրանց էջում ցանկի տեսքով։
// `language` հատկության հնարավոր տարբերակներն են ['javascript', 'react',  'node', "HTLM&CSS"]
// Գրանցման տարեթիվը պահելու և ցուցադրելու համար օգտագործել `moment` package-ը
// Այնպես պետք է անել որ նրանք ովքեր գրանցվել են դասընթացին տարբերվեն գույներով 
// "javascript" => #2ecc71
// "react" => #2980b9
// "node" => #1abc9c
// "HTLM&CSS" => #bdc3c7

// - Հնարավորություն պետք է լինի սորտավորել նրանց ժամանակագրային տարբերակով սկզբում լինեն ամենահին գրանցվածները
// - Հնարավորություն պետք է լինի ՖԻԼՏՐԵԼ նրանց ըստ `language` հատկության։ Օրինակ Միայն 'javascript' ընտրած ուսանողները ցուցադրվեն և այլն։